{
  "basics": {
    "name": "Xueshan Wang",
    "label": "Junior Full Stack Developer",
    "image": null,
    "email": "xuewang414@icloud.com",
    "phone": null,
    "url": "https://cytrogen.icu/",
    "summary": "Junior Full Stack Developer with a passion for building web applications. Currently seeking opportunities to further develop my skills in a professional setting.",
    "theme": "default",
    "location": {
      "address": "",
      "postalCode": "10001",
      "city": "New York",
      "countryCode": "NY",
      "region": "United States"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "xueshanw",
        "url": "https://www.linkedin.com/in/xueshanw/"
      },
      {
        "network": "Facebook",
        "username": "Xueshan Wang",
        "url": "https://www.facebook.com/people/Xueshan-Wang/pfbid0CKYBdMNtrGAJBzp2uAKbQVPuWMUdPixqyQtxnnbwrNdHDVLcUQCB9cs9Qi2aAjusl/"
      },
      {
        "network": "GitHub",
        "username": "Cytrogen",
        "url": "https://github.com/Cytrogen"
      }
    ]
  },
  "work": [
    {
      "name": "Verderia NGO",
      "position": "Website Administrator",
      "location_type": "Remote",
      "location": "Remote",
      "url": "https://verderiango.com",
      "startDate": "2024-12",
      "endDate": null,
      "summary": "Managing and maintaining the organization's WordPress website while implementing performance optimizations through CloudFlare and ensuring alignment with organizational objectives.",
      "highlights": [
        "Implemented CloudFlare for improved website performance and security",
        "Managed WordPress site maintenance and content updates",
        "Successfully configured and maintained DNS settings"
      ],
      "responsibilities": [
        "Developed and maintained the organization's WordPress website",
        "Managed domain registration and DNS configuration through CloudFlare",
        "Provided technical support and WordPress solutions for day-to-day operations",
        "Implemented website updates and security patches",
        "Collaborated with team members to ensure website content alignment with goals"
      ],
      "achievements": [
        "Enhanced website security and performance through CloudFlare integration",
        "Established efficient WordPress maintenance procedures",
        "Streamlined content management workflow"
      ],
      "skills": [
        "WordPress",
        "CloudFlare",
        "DNS Management",
        "Yoast SEO",
        "Content Management",
        "Technical Support"
      ]
    },
    {
      "name": "LotusHabits",
      "position": "Frontend Developer",
      "location_type": "Hybrid",
      "location": "New York, United States",
      "url": null,
      "startDate": "2024-01",
      "endDate": "2024-04",
      "summary": "Collaborated with cross-functional teams to develop responsive web applications using React and Redux, with a focus on enhancing user experience through improved content rendering and Firebase integration.",
      "highlights": [
        "Implemented advanced Markdown rendering system to improve content readability",
        "Built robust user authentication system using Firebase",
        "Managed complex application state with Redux"
      ],
      "responsibilities": [
        "Developed and maintained React-based web applications with Redux state management",
        "Implemented user authentication and data persistence using Firebase",
        "Collaborated with cross-functional teams to design and implement responsive web applications",
        "Enhanced content display by implementing advanced Markdown rendering capabilities"
      ],
      "achievements": [
        "Improved user experience by developing an enhanced Markdown rendering system",
        "Successfully implemented and maintained secure user authentication flow",
        "Established efficient state management patterns using Redux"
      ],
      "skills": [
        "React",
        "Redux",
        "Firebase",
        "Git",
        "Responsive Design"
      ]
    },
    {
      "name": "Song Tea",
      "position": "Tea Shop Associate",
      "location_type": "In-person",
      "location": "New York, United States",
      "url": null,
      "startDate": "2023-07",
      "endDate": "2024-07",
      "summary": "Provided excellent customer service at a to-go bubble tea shop, handling all aspects of beverage preparation and customer interactions.",
      "highlights": [
        "Prepared high-quality bubble tea beverages according to customer specifications",
        "Delivered exceptional customer service in a fast-paced to-go environment",
        "Maintained cleanliness and organization of work station and equipment"
      ],
      "responsibilities": [
        "Greeted and assisted customers with menu selections and special requests",
        "Prepared various bubble tea drinks including fruit teas, milk teas, and specialty beverages",
        "Operated point-of-sale system for order processing and payment handling",
        "Maintained inventory of ingredients and supplies"
      ],
      "achievements": [
        "Consistently maintained high customer satisfaction in busy to-go environment",
        "Mastered preparation of diverse menu items efficiently"
      ],
      "skills": [
        "Customer Service",
        "Beverage Preparation",
        "POS Systems",
        "Time Management",
        "Food Safety"
      ]
    },
    {
      "name": "New Kims Wei Restaurant",
      "position": "Multi-role Associate",
      "location_type": "In-person",
      "location": "New York, United States",
      "url": null,
      "startDate": "2019-09",
      "endDate": "2021-06",
      "summary": "Performed multiple roles in a busy restaurant environment including cashier duties, phone orders, food packaging, front desk operations, and kitchen assistance.",
      "highlights": [
        "Successfully managed multiple responsibilities across front-of-house and kitchen operations",
        "Handled customer transactions and phone orders with accuracy and efficiency",
        "Supported kitchen operations including food preparation and frying duties"
      ],
      "responsibilities": [
        "Operated cash register and processed customer payments accurately",
        "Answered phone calls and took customer orders for takeout and delivery",
        "Packaged food orders ensuring proper presentation and completeness",
        "Managed front desk operations and greeted customers",
        "Assisted with kitchen duties including frying and food preparation"
      ],
      "achievements": [
        "Developed strong multitasking abilities while maintaining quality service",
        "Gained comprehensive restaurant operation experience across multiple departments"
      ],
      "skills": [
        "Customer Service",
        "Cash Handling",
        "Phone Communication",
        "Food Preparation",
        "Multitasking",
        "Kitchen Operations"
      ]
    }
  ],
  "education": [
    {
      "institution": "Baruch College",
      "url": "https://www.baruch.cuny.edu/",
      "area": "Computer Science",
      "studyType": "Bachelor of Science - BS",
      "startDate": "2023-08",
      "endDate": "2027-06",
      "score": null,
      "courses": []
    },
    {
      "institution": "High School of Fashion Industries",
      "url": "https://www.hsfi.nyc/",
      "area": "Graphic Design",
      "studyType": "High School Diploma",
      "startDate": "2019-09",
      "endDate": "2023-06",
      "score": null,
      "courses": []
    }
  ],
  "certificates": [
    {
      "name": "Full Stack Application Development",
      "date": "2024-07",
      "issuer": "IBM",
      "url": "http://credentials.edx.org/credentials/500597d8a3194bc5a36dd860d7e05c08/"
    },
    {
      "name": "AWS APAC - Solutions Architecture",
      "date": "2024-07",
      "issuer": "Forage",
      "url": "https://forage-uploads-prod.s3.amazonaws.com/completion-certificates/AWS/kkE9HyeNcw6rwCRGw_AWS%20APAC_NXBfKxjzRXxZx9Qns_1721688206871_completion_certificate.pdf"
    },
    {
      "name": "Software Engineering",
      "date": "2024-07",
      "issuer": "J.P. Morgan via Forage",
      "url": "https://forage-uploads-prod.s3.amazonaws.com/completion-certificates/J.P.%20Morgan/R5iK7HMxJGBgaSbvk_J.P.%20Morgan_NXBfKxjzRXxZx9Qns_1720411263732_completion_certificate.pdf"
    },
    {
      "name": "Agile Methodologies",
      "date": "2024-07",
      "issuer": "JPMorgan Chase & Co. via Forage",
      "url": "https://forage-uploads-prod.s3.amazonaws.com/completion-certificates/J.P.%20Morgan/5QiaMtZ4k8ngYKn4D_JPMorgan%20Chase%20&%20Co._NXBfKxjzRXxZx9Qns_1720460766984_completion_certificate.pdf"
    },
    {
      "name": "CS50's Introduction to Programming with Python",
      "date": "2023-10",
      "issuer": "CS50",
      "url": "https://certificates.cs50.io/396eda1b-fa87-4c11-99ed-7e2b7aec4623.png"
    },
    {
      "name": "CS50's Introduction to Artificial Intelligence with Python",
      "date": "2023-09",
      "issuer": "CS50",
      "url": "https://certificates.cs50.io/6c7cc2d1-ae4d-44de-9d4d-4e2db88531a9.png"
    },
    {
      "name": "CS50's Introduction to Computer Science",
      "date": "2022-12",
      "issuer": "CS50",
      "url": "https://cs50.harvard.edu/certificates/a9b155f9-bd43-4c0d-9393-89a0efd051bb.png"
    }
  ],
  "skills": [
    {
      "name": "React",
      "level": "Advanced",
      "keywords": ["Frontend Development", "UI Framework"]
    },
    {
      "name": "Nestjs",
      "level": "Intermediate",
      "keywords": ["Backend Development", "Node.js Framework"]
    },
    {
      "name": "TypeScript",
      "level": "Advanced",
      "keywords": ["Static Typing", "JavaScript Superset"]
    },
    {
      "name": "Python",
      "level": "Intermediate",
      "keywords": ["Backend Development", "Data Processing"]
    },
    {
      "name": "Git",
      "level": "Advanced",
      "keywords": ["Version Control", "Collaboration"]
    }
  ],
  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native or bilingual proficiency"
    },
    {
      "language": "English",
      "fluency": "Limited working proficiency"
    },
    {
      "language": "Japanese",
      "fluency": "Elementary proficiency"
    }
  ],
  "interests": [
    {
      "name": "Technical Writing",
      "keywords": [
        "Technical Blogs",
        "Programming Tutorials",
        "Knowledge Sharing"
      ]
    },
    {
      "name": "Technology",
      "keywords": [
        "Web Development",
        "Software Engineering",
        "New Technologies"
      ]
    },
    {
      "name": "Game Development",
      "keywords": [
        "Unity Engine",
        "Game Jams",
        "Indie Game Development"
      ]
    }
  ],
  "projects": [
    {
      "name": "GameBoyJS",
      "isActive": true,
      "description": "A modern JavaScript implementation of a Game Boy emulator built for the web using ES6+ features, designed as a comprehensive learning project to understand computer architecture and emulation principles.",
      "highlights": [
        "Architected a complete Game Boy CPU emulator using modern ES6 JavaScript with modular design patterns",
        "Implemented accurate instruction set emulation including registers, memory management, and timing cycles",
        "Developed comprehensive PPU (Picture Processing Unit) for authentic graphics rendering and sprite handling",
        "Created detailed technical documentation and tutorial articles explaining emulation concepts and implementation details",
        "Built from scratch to understand low-level computer architecture, memory mapping, and hardware emulation principles",
        "Ongoing development project focusing on accuracy, performance optimization, and educational value"
      ],
      "url": null,
      "github": "https://github.com/Cytrogen/GameBoyJs"
    },
    {
      "name": "Svg2SvgIcon Converter",
      "isActive": true,
      "description": "A pure client-side online tool that converts SVG code or files into Material-UI (MUI) SvgIcon components ready for use in React projects, featuring real-time preview and intelligent parsing capabilities.",
      "highlights": [
        "Developed a React-based converter with Material-UI components for seamless SVG to MUI SvgIcon transformation",
        "Implemented intelligent viewBox parsing that automatically detects existing viewBox attributes or generates them from width/height properties",
        "Created a real-time viewBox controller with live preview, allowing precise adjustment of icon viewport and cropping",
        "Built comprehensive SVG parsing engine supporting nested elements, inline styles, and complex SVG structures",
        "Integrated error handling system with collapsible console and visual error indicators for enhanced user experience",
        "Ensured complete client-side processing for maximum privacy and security without server data transmission"
      ],
      "url": "https://svg2svgicon.cytrogen.icu",
      "github": "https://github.com/cytrogen/svg2svgicon"
    },
    {
      "name": "BetterBaruch Toolbox Website",
      "isActive": true,
      "description": "A comprehensive collection of utilities designed specifically for the Baruch College community, presented through an engaging, interactive web interface.",
      "highlights": [
        "Developed a modern web application using React and Vite for optimized performance and enhanced developer experience",
        "Created an interactive 3D model of the Baruch Bearcat mascot using Three.js with custom animations and dynamic lighting effects",
        "Engineered a responsive design system that delivers a consistent experience across desktop and mobile devices",
        "Implemented a modular architecture allowing for seamless integration of new tools and easy maintenance",
        "Incorporated efficient routing and state management for a smooth single-page application experience",
        "Optimized 3D rendering performance through advanced techniques including texture compression and level-of-detail management"
      ],
      "url": "https://2b.cytrogen.icu",
      "github": "https://github.com/Cytrogen/better-baruch-website"
    },
    {
      "name": "BetterBaruch - DegreeWorks Helper",
      "isActive": true,
      "description": "A browser extension that enhances the Baruch College website experience by adding useful features and improvements for students navigating academic resources.",
      "highlights": [
        "Engineered a cross-browser extension using vanilla JavaScript for Chrome and Edge platforms",
        "Implemented a serverless backend architecture with Express.js deployed on AWS Lambda for scalability",
        "Successfully published and actively maintaining the extension on the Chrome Web Store with regular updates",
        "Enhanced student website usability through feature additions including improved navigation, information display, and workflow optimizations"
      ],
      "url": "https://chromewebstore.google.com/detail/better-baruch/hbhppighkhlcjdbijfgehnjklhepmcmb",
      "github": null
    },
    {
      "name": "BetterBaruch - Rally Nexus",
      "isActive": true,
      "description": "A comprehensive mobile application designed to enhance the Baruch College student experience by providing centralized access to campus clubs and events information through an intuitive interface.",
      "highlights": [
        "Engineered a React Native mobile application that streamlines navigation of Baruch University's student organizations and campus activities",
        "Designed a scalable NestJS backend with serverless architecture using AWS Lambda and DynamoDB for efficient data management",
        "Developed an automated web scraper using Puppeteer to extract and synchronize real-time club information from official university sources",
        "Integrated RSS feed technology to deliver up-to-date campus events directly to users' mobile devices",
        "Established a CI/CD pipeline with GitHub Actions for automated builds and releases triggered by version tags",
        "Created a responsive UI that delivers a consistent experience across different mobile devices and screen sizes"
      ],
      "url": null,
      "github": "https://github.com/Cytrogen/BetterBaruchRN"
    },
    {
      "name": "Portfolio Website",
      "isActive": true,
      "description": "Personal portfolio website showcasing projects and skills, built with modern web technologies for optimal performance and user experience.",
      "highlights": [
        "Leveraged Astro framework and TailwindCSS to create a high-performance static website with minimal JavaScript",
        "Implemented responsive design principles ensuring seamless experience across all device sizes",
        "Integrated dark mode support with persistent user preferences and smooth transitions",
        "Designed interactive project showcases with engaging animations and comprehensive skills visualization"
      ],
      "url": "https://portfolio.cytrogen.icu",
      "github": "https://github.com/Cytrogen/Astro-Portfolio-Page"
    },
    {
      "name": "Personal Blog",
      "isActive": true,
      "description": "A technical blog platform for sharing in-depth programming insights, tutorials, and development experiences with the broader tech community.",
      "highlights": [
        "Leveraged Hexo framework for efficient static site generation and optimal loading performance",
        "Authored comprehensive technical articles and step-by-step tutorials on various programming topics",
        "Implemented custom theme modifications and functionality extensions to enhance reader experience",
        "Established automated content deployment workflows and maintenance processes for consistent publishing"
      ],
      "url": "https://cytrogen.icu/en",
      "github": null
    },
    {
      "name": "HP Instant Ink Calculator",
      "isActive": true,
      "description": "A user-friendly web tool designed to help users determine the most cost-effective HP Instant Ink subscription plan based on their specific printing needs and usage patterns.",
      "highlights": [
        "Developed a responsive React-based calculator that determines the most economical HP Instant Ink plan based on page volume",
        "Implemented bilingual support with seamless switching between English and Chinese interfaces",
        "Created a transparent cost breakdown showing base costs, extra page fees, and total expenses for all available plans",
        "Built with client-side processing ensuring calculations are performed locally without sending sensitive data to servers",
        "Designed with a clean, intuitive UI that highlights the recommended plan for easy decision-making"
      ],
      "url": "https://hp2ic.cytrogen.icu",
      "github": "https://github.com/Cytrogen/hp-instant-ink-calculator"
    },
    {
      "name": "Kaspersky To 1Password",
      "isActive": true,
      "description": "A specialized web utility for converting TXT exports from Kaspersky Password Manager into CSV format compatible with 1Password and other password management solutions.",
      "highlights": [
        "Implemented client-side file processing architecture ensuring all sensitive data remains local for maximum security",
        "Developed with React and Tailwind CSS to create a responsive, intuitive user interface across devices",
        "Engineered comprehensive Unicode character support including CJK (Chinese, Japanese, Korean) text handling",
        "Created robust UTF-8 encoding for CSV outputs ensuring compatibility with multiple password manager import systems"
      ],
      "url": "https://ktoc.cytrogen.icu",
      "github": "https://github.com/Cytrogen/kaspersky-to-1password"
    },
    {
      "name": "Hexo-Theme-Ares",
      "isActive": true,
      "description": "A feature-rich, highly customizable theme for the Hexo blogging platform that enhances content presentation with advanced functionality and internationalization support.",
      "highlights": [
        "Developed a modern theme architecture using Pug templating engine and JavaScript for flexibility and performance",
        "Implemented lightning-fast local search functionality with keyword highlighting and result previews",
        "Integrated syntax highlighting for code blocks with customizable styling and line numbering",
        "Built native support for Mermaid diagrams enabling complex visualizations within blog posts",
        "Engineered comprehensive internationalization support with multi-language content management",
        "Incorporated Disqus commenting system and Google Analytics with privacy-conscious loading options"
      ],
      "url": null,
      "github": "https://github.com/Cytrogen/hexo-theme-ares"
    },
    {
      "name": "Shopping-Nest",
      "isActive": false,
      "description": "A full-stack e-commerce platform built to explore and document the complete development process, serving as both a practical implementation and educational resource.",
      "highlights": [
        "Architected a comprehensive e-commerce solution with React and TailwindCSS frontend, NestJS and MySQL backend",
        "Implemented secure user authentication, product catalog management, and interactive shopping cart functionality",
        "Designed and developed RESTful APIs with proper validation and established secure database connections",
        "Documented the entire development journey through detailed technical blog posts for educational purposes"
      ],
      "url": null,
      "github": null
    },
    {
      "name": "Hotaru.TS",
      "isActive": false,
      "description": "A Discord-inspired full-stack real-time chat application built as a learning project to explore modern web technologies and architecture patterns.",
      "highlights": [
        "Architected a comprehensive chat platform with React frontend and NestJS backend utilizing TypeScript",
        "Implemented real-time message delivery using Socket.io with optimized event handling and state management",
        "Designed a scalable data persistence layer using MongoDB for message and user information storage",
        "Integrated secure file sharing capabilities through MinIO object storage with proper access controls",
        "Developed a robust authentication system with JWT tokens and role-based authorization"
      ],
      "url": null,
      "github": "https://github.com/Cytrogen/Hotaru.TS"
    }
  ]
}